src/cf/src/DataProcessors/ЛичныйКабинетПартнера/ЛичныйКабинетПартнера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЛичныйКабинетПартнера</name>
  <tabularSections>
    <name>Корзина</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаЗаказов</name>
    <attributes>
      <name>ДокументЗаказа</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КнопкаРазвернуть</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КнопкаПовтора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Развернуто</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаЗаявок</name>
    <attributes>
      <name>ДокументЗаявки</name>
      <type>
        <types>DocumentRef.ЗаявкаНаПоискТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаявки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/cf/src/Enums/СтатусыЗаявокНаПоискТоваров/СтатусыЗаявокНаПоискТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаПоискТоваров</name>
  <enumValues>
    <name>ОжидаетМенеджера</name>
  </enumValues>
  <enumValues>
    <name>Поиск</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Найдено</name>
  </enumValues>
  <enumValues>
    <name>НеНайдено</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ЗаявкаНаПоискТовара/ЗаявкаНаПоискТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПоискТовара</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаПоискТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСайтПроизводителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/DataProcessors/ЛичныйКабинетПартнера/Forms/ФормаЗаявкиНаПоискТовара/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Описание.Заголовок = Нстр("fr = 'Explication'; ru = 'Описание'; en = 'Description'; es = 'Descripción'");       
	ЭтаФорма.Заголовок = Нстр("fr = 'Demande de recherche de produit'; ru = 'Заявка на поиск товара'; en = 'Product search request'; es = 'Solicitud de búsqueda de producto'"); 
	Элементы.КомандаЗаписатьЗаявкуНаПоискТовара.Заголовок = Нстр("fr = 'Faire une demande de recherche de produit'; ru = 'Оформить заявку на поиск товара'; en = 'Apply for a product search'; es = 'Solicitar la búsqueda de productos'");
    ПоисковыйЗапрос = ЭтаФорма.Параметры.ПоисковыйЗапрос;
КонецПроцедуры

&НаСервере
Процедура КомандаЗаписатьЗаявкуНаПоискТовараНаСервере()
	
	Док = Документы.ЗаявкаНаПоискТовара.СоздатьДокумент();
	Док.Дата = ТекущаяДата();  
	док.Статус = Перечисления.СтатусыЗаявокНаПоискТоваров.ОжидаетМенеджера;
	Док.Описание = Нстр("fr = 'Requête de recherche - '; ru = 'Поисковый запрос - '; en = 'Search query - '; es = 'Consulta de búsqueda - '")+
	ПоисковыйЗапрос + Символы.ПС+
	СокрЛП(Описание); 
	Док.Контрагент = ПараметрыСеанса.Контрагент;
	Док.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьЗаявкуНаПоискТовара(Команда)
	КомандаЗаписатьЗаявкуНаПоискТовараНаСервере();  
	ЭтаФорма.Закрыть();
КонецПроцедуры
